// ============================================================================
// Target
// ----------------------------------------------------------------------------
"Target.ESP_title" = "Install Clover in the ESP";
"Target.ESP_description" = "Install Clover in the ESP (EFI System Partition) of the target volume

Need to format ESP as Fat32 (recommended) or HFS on Mac first.

For Fat32 use commands like:
diskutil list
newfs_msdos -v EFI -F 32 /dev/rdisk9s1

For HFS use commands like:
diskutil list
newfs_hfs -v EFI /dev/rdisk9s1";

// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Bootloader_title" = "Bootloader";
"Bootloader_description" = "Clover EFI wymaga trzech podstawowych plików. (w skrócie)
boot0 (w głównym rekordzie startowym dysku) odpowiedzialny za ładowanie boot1.
boot1 (w boot sektorze partycji) odpowiedzialny za odnajdowanie boot2.
boot2 (w głównym katalogu partycji) odpowiedzialny za ładowanie /EFI/BOOT/CLOVERIA32.efi lub CLOVERX64.efi, kernel etc.";

"boot0_title" = "BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Używa pliku fdisk440 do instalacji boot0 do pierwszych 440 bitów głównego sektora rozruchowego bez uszkadzania istniejących systemów Windows, następnie boot0 wyszuka pierwszej aktywnej partycji HFS, boot1h2 lub pierwszą aktywną partycję Fat32 dla boot1f32alt.
Opcja ta ustawi wybraną partycję HFS lub Fat32 jako aktywną.
Wymagane jest sformatowanie partycji na Fat32 w Windowsie lub w Mac OS wg poniższej instrukcji.
  1. Wymazanie partycji jako MS-DOS (FAT) w Narzędziu Dyskowym. Natępnie wykonanie poniższych komend w Terminalu:
  2. diskutil list
  3. diskutil unmount /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY
  5. diskutil mount /dev/rdiskXsY";

"boot0hfs_title" = "BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Używa pliku fdisk440 do instalacji boot0 do pierwszych 440 bitów głównego sektora rozruchowego bez uszkadzania istniejących systemów Windows, następnie boot0hfs wyszuka partycji HFS, boot1h2 lub pierwszą aktywną partycję Fat32 dla boot1f32alt.
Opcja ta nie ustawi wybranej partycji HFS jako aktywnej jednak partycja Fat32 zostanie aktywowana.
Wymagane jest sformatowanie partycji na Fat32 w Windowsie lub w Mac OS wg poniższej instrukcji.
  1. Wymazanie partycji jako MS-DOS (FAT) w Narzędziu Dyskowym. Natępnie wykonanie poniższych komend w Terminalu:
  2. diskutil list
  3. diskutil unmount /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY
  5. diskutil mount /dev/rdiskXsY";

"bootNo_title" = "Don't update MBR and PBR sectors";
"bootNo_description" = "Don't install any bootloader (boot0X, boot1X).
Usefull for UEFI motherboards that don't need bootloader files.
Can also be use if you don't want to upgrade MBR or PBR sectors.";

"AltBoot_title" = "Use alternative booting PBR";
"AltBoot_description" = "Install alternative booting PBR with choice of boot with a key pressed.
File to boot = boot{keypressed}";


"boot32_title" = "Instalacja i startowanie w trybie 32bit";
"boot32_description" = "Instaluje plik boot i startuje system w 32 bitach.
Podczas rozruchu można:
Wcisnąć klawisz 1 do uruchomienia boot1 = Chameleon boot,
Wcisnąć klawisz 3 do uruchomienia boot3 = Clover EFI 32bit boot,
Wcisnąć klawisz 6 do uruchomienia boot6 = Clover EFI 64bit boot.";

"boot64_title" = "Instalacja i startowanie w trybie 64bit";
"boot64_description" = "Instaluje plik boot i startuje system w 64 bitach.
Podczas rozruchu można:
Wcisnąć klawisz 1 do uruchomienia boot1 = Chameleon boot,
Wcisnąć klawisz 3 do uruchomienia boot3 = Clover EFI 32bit boot,
Wcisnąć klawisz 6 do uruchomienia boot6 = Clover EFI 64bit boot.";

// ============================================================================
// CloverEFI
// ----------------------------------------------------------------------------
"CloverEFI_title" = "CloverEFI";
"CloverEFI_description" = "Wybierz wersję CloverEFI do zainstalowania.";
"cloverEFI.32_title" = "CloverEFI 32 bity";
"cloverEFI.32_description" = "CloverEFI 32 bity";
"cloverEFI.64.sata_title" = "CloverEFI 64 bity SATA";
"cloverEFI.64.sata_description" = "CloverEFI 64 bity przy użyciu kontrolera SATA do uzyskania dostępu do dysków";
"cloverEFI.64.blockio_title" = "CloverEFI 64 bitys BiosBlockIO";
"cloverEFI.64.blockio_description" = "CloverEFI 64 bity przy użyciu Bios Block I/O do uzyskania dostępu do dysków";

// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Tematy graficzne";
"Themes_description" = "Wybierz w celu zainstalowania.";

"black_green_title" = "black_green";
"black_green_description" = "Domyślny temat black_green od Blackosx,
Lokalizacja tematu: /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme od Eps,
Lokalizacja tematu: /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme od mrengles,
Lokalizacja tematu: /EFI/BOOT/themes/mrengles.";

"iBootloader_title" = "iClover";
"iBootloader_description" = "Grey style theme by winlog,
Lokalizacja tematu: /EFI/BOOT/themes/iClover.";

"buttons_title" = "buttons";
"buttons_description" = "Temat Buttons od Trauma,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Temat Hellfire od illevelll,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Oryginalny temat metal od Slice,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Temat Simple_gray od hijeane,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Temat Wooden od iROOTa,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/wooden.";

// ============================================================================
// RC Scripts
// ----------------------------------------------------------------------------
"rc.scripts.on.target_title" = "Instaluj skrypty RC na dysku docelowym";
"rc.scripts.on.target_description" = "Instaluj wszystkie skrypty RC na dysku docelowym.
Dysk docelowy musi być bootlowalnym dyskiem systemowym OSX.";
"rc.scripts.on.all.volumes_title" = "Instaluj wszystkie skrypty RC na wszystkich bootowalnych dyskach systemowych OSX.";
"rc.scripts.on.all.volumes_description" = "Instaluj wszystkie skrypty RC na wszystkich wewnętrznych bootowalnych dyskach systemowych OSX.";
"Optional RC Scripts" = "Opcjonalne skrypty RC";
"disable sleep proxy client" = "Wyłącz klienta proxy sleepu";
"disable_sleep_proxy_client_description" = "Wyłącz mDNSResponder - usługi klienta proxy sleepu. Zapobiega to automatycznemu wybudzaniu ze sleepu co godzinę.";

// ----------------------------------------------------------------------------